{"_id":{"$oid":"59098e1ffa210b111a80c8ff"},"updatedAt":{"$date":"2017-05-03T08:00:31.526Z"},"createdAt":{"$date":"2017-05-03T08:00:31.526Z"},"title":"Exercice 1","content":"Email :  frecheville.cedric@gmail.com\nMdp : jirachi\n\nUn fork permet de copier un projet déjà existant afin de pouvoir modifier le code de celui-ci sans altérer le code d'origine.\n\nUne pull request permet de demander d'ajouter une modification faites sur le code d'un projet.\nL'interêt de la pull request est d'ajouter un code en vérifiant si il n'y a pas de conflit. \n\nUne branche permet de créer une copie locale du projet en cours de développement, ainsi les modifications apportées ne seront actives que sur cette branche tant que celle-ci n'est pas mergée avec la branche principale\n\nUn branche est une copie du projet sur lequel on travaille actuellement, alors qu'un fork s'applique sur un projet qui n'est pas le nôtre à la base","__v":0}
{"_id":{"$oid":"590995ccfa210b111a80c900"},"updatedAt":{"$date":"2017-05-03T08:33:16.235Z"},"createdAt":{"$date":"2017-05-03T08:33:16.235Z"},"title":"La MEAN stack","content":"1.\n\nAngular :\n\nA : Permet de faire le projet\nB : Front \u0026 Back\nC : Non\n\nAngular UI Router :\n\nA : Permet de faire des outes\nB : Front \u0026 Back\nC : Oui\n\nExpress\n\nA : Permet de générer automatiquement des applications de base, mais aussi de définir des routes\nB : Back\nC : Non\n\nJSONWebToken\n\nA : Permet de sécuriser les routes\nB : Back\nC : Non \n\nMongoose\n\nA : Permet de gérer la base de données\nB : Back\nC : Non\n\nMaterializeCSS\n\nA : Sert a styliser la page \nB : Front\nC : Oui\n\nPassport\n\nA : Permet de gérer l'authentification\nB : Back\nC : Non\n\nBabel\n\nA : Permet de rendre compatible les fichiers minifiés avec les navigateurs\nB : Back\nC : Non\n\nSCSS\n\nA : Permet de faire du CSS\nB : Front \nC : Oui\n\nNodemon\n\nA : Permet de recharger la page quand on change le code\nB : Front\nC : Oui \n\nWebpack\n\nA : Permet de \nB : Back\nC : Non\n\nLivereload\n\nA : Rafraichit la page lorsqu le code est changé\nB : Front\nC : Oui\n\n2. La mean stack est une collection de technologies JavaScript, permettant de développer des applications web.","__v":0}
{"_id":{"$oid":"5909e84f9c624d08a633e49b"},"updatedAt":{"$date":"2017-05-03T14:25:19.459Z"},"createdAt":{"$date":"2017-05-03T14:25:19.459Z"},"title":"Exercice 7 - SCRUM","content":"Que sont les méthodes agiles ? \n\nLes méthodes agiles sont des pratiques permettant une meilleure réalisation de projet, qui implique également le client. Ces méthodes sont faites pour pouvoir s'adapter à toute situation.\n\nQu’est-ce que SCRUM ?\n\nSCRUM est une méthode agile de gestion de projet. On établie des \"sprints\" chaque semaines, qui comporte les taches a réalisés, taches qui sont contenus dans un tableau (numérique ou avec des post-it).\n\nDéfinir le Product BackLog, de quoi est-il constitué ?\n\nLe product Backlog contient toute les étapes relatives à un projet. SI toutes les tâches contenues dans le product backlog sont terminées, le projet est alors considéré comme étant terminé.\n\nDéfinir le Product Owner.\n\nLe Product Owner est celui qui représente les clients et les utilisateurs, c'est lui qui dirige le déroulement du projet en indiquant quelles tâches sont prioritaires\n\nDéfinir le SCRUM Master \n\nLe SCRUM Master s'assure que la méthode SCRUM soit bien appliquée au cours du projet par l'équipe, c'est également lui qui initie les rituels liés à la méthode (Daily Scrum etc...)\n\nDéfinir la « Development team »\n\nLa dévelopment team est l'équipe de développement qui travaille sur le projet, le Product OWner et le Scrum master peuvent également faire partie de cette équipe.\n\nDéfinir le Sprint, de quoi est-il constitué ?\n\nLe Sprint est établie en début de semaine et contient toutes les taches qui sont a faire d'ici la fin de la semaine.\n\nDéfinir le daily scrum\n\nLe daily scrum est une réunion de maximun 15 minutes organisée au sein de l'équipe tout les jours, afin de parler des avancées du projet en cours et changer l'état des tâches si il y a besoin.\n\nQu’est-ce que la planification d’un sprint ?\n\nLa planification d'un sprint est réalisé en début de semaine, c'est à ce moment que l'on définie les taches à réaliser pour la semaine.\n\nQu’est-ce que la révision d’un sprint ?\n\nLa révision d'un sprint est la présentation des avancée de la semaine de la part de l'équipe de développement.\n\nQu’est-ce que la rétrospective d’un sprint ?\n\nRéunion ayant pour but d'améliorer les prochains sprints\n\nPourquoi est-il important de définir la notion de « Done » pour les tâches ?\n\nC'est important afin de voir quelles tâches sont terminées\n\nLa notion de « Done » peut-elle évoluer au cours d’un projet SCRUM ?\n\nOui elle peut évoluer car la méthode SCRUM est agile et on peut revenir sur les critères de résolution d'un tache\n\nSCRUM est-elle une méthodologie itérative ? Justifier.\n\nOui c'est une méthode itérative, car les étapes sont répétées plusieurs fois au cours du projet.","__v":0}
